
[IOC - svchost.exe not run by services.exe]
action.email = 1
action.email.priority = 1
action.email.to = security_team@rightnetworks.com
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */15 * * * *
dispatch.earliest_time = -15m
display.page.search.mode = verbose
display.visualizations.charting.chart = pie
display.visualizations.type = mapping
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = sysmon_threat_int
request.ui_dispatch_view = search
search = index=sysmon sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode="1" svchost.exe\
| search (Image="*\\svchost.exe") (ParentImage!="*\\services.exe")

[IOC - Suspicious binary launch location]
action.email = 1
action.email.to = jpolcari@rightnetworks.com
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */15 * * * *
dispatch.earliest_time = -15
display.page.search.mode = fast
display.visualizations.charting.chart = pie
display.visualizations.type = mapping
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = sysmon_threat_int
request.ui_dispatch_view = search
search = index=sysmon sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode="1" (Image="C:\\windows\\fonts\\*" OR Image="C:\\windows\\help\\*" OR Image="C:\\windows\\wbem\\*" OR Image="C:\\windows\\addins\\*" OR Image="C:\\windows\\debut\\*" OR Image="C:\\windows\\system32\\tasks*" OR Image="C:\\windows\\tasks\\*" OR Image="C:\\debug\\*")

[IOC - Commands run from Office Doc/Browser]
action.email = 1
action.email.priority = 2
action.email.to = jpolcari@rightnetworks.com
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */15 * * * *
dispatch.earliest_time = -15
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.type = mapping
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = sysmon_threat_int
request.ui_dispatch_view = search
search = index=sysmon sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 ParentImage="C:\\Program Files (x86)\\Microsoft Office\\Office14\\WINWORD.EXE" OR ParentImage="C:\\Program Files (x86)\\Microsoft Office\\Office14\\OUTLOOK.EXE" OR ParentImage="C:\\Program Files (x86)\\Microsoft Office\\Office14\\EXCEL.EXE" OR ParentImage="C:\\Program Files (x86)\\Microsoft Office\\Office14\\POWERPNT.EXE" OR ParentImage="C:\\Program Files (x86)\\Internet Explorer\\iexplore.exe" OR ParentImage="C:\\Program Files\\Internet Explorer\\iexplore.exe" OR ParentImage="C:\\Program Files (x86)\\Mozilla Firefox\\firefox.exe" OR ParentImage="C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe" AND (Image="C:\\Windows\\SysWOW64\\WindowsPowerShell\\v1.0\\powershell.exe" OR Image="C:\\Windows\\System32\\cmd.exe" OR Image="C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe" OR Image="C:\\Windows\\System32\\rundll32.exe" OR Image="C:\\Windows\\System32\\wscript.exe" OR Image="C:\\Windows\\System32\\cscript.exe") CurrentDirectory!="C:\\Program Files (x86)\\Adobe\\Acrobat Reader DC\\Reader\\Browser\\WCChromeExtn\\"  CurrentDirectory!="C:\\Users\\*\\AppData\\Local\\Blue Jeans\\App\\" CommandLine!="*ScreenConnect*" CommandLine!="C:\\windows\\system32\\rundll32.exe C:\\windows\\system32\\inetcpl.cpl,ClearMyTracksByProcess*"| table  _time host ParentImage CommandLine

[IOC - Abnormally long Powershell Command]
action.email = 1
action.email.priority = 2
action.email.to = jpolcari@rightnetworks.com
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */20 * * * *
dispatch.earliest_time = -20
display.page.search.mode = verbose
display.visualizations.charting.chart = pie
display.visualizations.type = mapping
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = sysmon_threat_int
request.ui_dispatch_view = search
search = index=sysmon sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 Image="C:\\Windows\\SysWOW64\\WindowsPowerShell\\v1.0\\powershell.exe" OR Image="C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe" | eval c_length=len(CommandLine) | where c_length>500

[IOC - >5 Critical Process in 10m]
action.email = 1
action.email.priority = 2
action.email.to = jpolcari@rightnetworks.com
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */10 * * * *
dispatch.earliest_time = -10m
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.type = mapping
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = sysmon_threat_int
request.ui_dispatch_view = search
search = index=sysmon sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode="1" (process="*\\powershell.exe" OR process="*\\msbuild.exe" OR process="*\\psexec.exe" OR process="*\\at.exe" OR process="*\\schtasks.exe" OR process="*\\net.exe" OR process="*\\vssadmin.exe" OR process="*\\utilman.exe" OR process="*\\wmic.exe" OR process="*\\mshta.exe" OR process="*\\whoami.exe" OR process="*\\mmc.exe" OR process="*\\systeminfo.exe" OR process="*\\csvde.exe" OR process="*\\nbtstat.exe")  ParentImage!="C:\\Program Files (x86)\\Microsoft Visual Studio *\\Common7\\IDE\\devenv.exe"  ParentImage="C:\\Program Files (x86)\\Microsoft Visual Studio\\2017\\Professional\\Common7\\ServiceHub\\Hosts\\ServiceHub.Host.Node.x86\\ServiceHub.Host.Node.x86.exe" | bin span=10m _time   | stats  values(CommandLine), count by host _time

[IOC - Powershell Suspicious Strings]
action.email = 1
action.email.priority = 2
action.email.to = jpolcari@rightnetworks.com
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */20 * * * *
dispatch.earliest_time = -20
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.type = mapping
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = sysmon_threat_int
request.ui_dispatch_view = search
search = index=sysmon sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 powershell.exe Invoke* OR IEX OR Download* \
| table _time, host, ProcessID, Image, CommandLine, ParentProcessId, ParentImage, ParentCommandLine

[IOC - Suspicious execution of rundll - User Profile/Browser]
action.email = 1
action.email.priority = 1
action.email.to = jpolcari@rightnetworks.com
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */20 * * * *
dispatch.earliest_time = -20
display.page.search.mode = verbose
display.visualizations.charting.chart = pie
display.visualizations.type = mapping
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = sysmon_threat_int
request.ui_dispatch_view = search
search = index=sysmon sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational"  EventCode=1 Image="C:\\Windows\\system32\\rundll32.exe" CommandLine=*C:\\Users\\* ParentCommandLine=\"C:\\Program Files\\Internet Explorer\\Iexplore.exe\"
